[
  {
    "title": "1",
    "order": "1",
    "name": "Two more interceptions. one final bow",
    "overlay": "right",
    "subhead": "Sept. 23, 2018 | Seahawks 24, Cowboys 13",
    "image": "earl1.jpg",
    "chatter": "<p>Everyone knew at the time that Seattle’s game against Dallas last Sept. 23 might be his last as a Seahawk, given his holdout and all the rumors connecting Thomas and the Cowboys.</p>\n<p>It seems even more fitting now that it really was his last game at CenturyLink Field, as it featured a little bit of all we came to know and love about Thomas — some game-turning plays followed by a couple of “Earl being Earl’’ moments and quotes.</p>\n<p>Thomas, who came to Seattle as a first-round pick out of Texas in 2010, had two interceptions in Seattle’s 24-13 win over Dallas, and after the last one, with 3:09 left in the game, he turned and took a bow in the direction of the Cowboys bench — a final <em>“he really did that?\"</em> act from a player who made a habit of them throughout his Seahawks career.</p>\n<p>“I felt like that was just, in the moment,’’ Thomas said of his bow. “And if they (the Cowboys) were going to trade for me and extend me, they should have did it.’’</p>\n<p>Asked later if he thought that was his final Seattle game — he would end up playing only one more — Thomas responded: “I don’t know if it was, but I had a damn good time, and I’ll go out like that if I have to.’’</p>",
    "credit": "Bettina Hansen / The Seattle Times",
    "youtube": "GZokUaRdb_c",
    "youtube2": "",
    "link": "https://www.seattletimes.com/sports/seahawks/why-did-seahawks-safety-earl-thomas-decline-to-practice-this-week-could-he-be-get-traded-to-the-cowboys-this-week-his-thoughts-here/"
  },
  {
    "title": "2",
    "order": "2",
    "name": "A knock on Gronk",
    "overlay": "left",
    "subhead": "Nov. 13, 2016 | Seahawks 31, Patriots 24",
    "image": "earl2.jpg",
    "chatter": "<p>In a game that in retrospect was one of the last great moments for the Legion of Boom — a win at New England on a Sunday night in 2016 — it was Thomas who truly put the B in boom.</p>\n<p>The defining moment of a 31-24 win over the Patriots came when Thomas and Kam Chancellor teamed for a hit on New England tight end Rob Gronkowski to force an incomplete pass — that, as it turned out, also gave Gronkowski a pulmonary contusion that caused him to miss a game.</p>\n<p>“That was a big hit for sure,\" Gronknowski said after the game, in which he continued to play — Chancellor would famously break up a pass intended for him on the final play. “Probably one of the hardest I’ve gotten in my career. It was a good, clean hit. Nothing against it. I just took it and it just knocked the wind out of me a little bit, that’s all.\"</p><p>Gronkowski called Thomas “a good fast player who’s like a missile.\"</p>\n<p>Said Thomas: “It just felt good because of the situation. They tried to look me off and I had a great break, I trusted myself. That was probably one of the best plays I’ve made in my career. It wasn’t a pick but it was technique sound. I trusted myself. I made a great play.\"</p>",
    "credit": "Mike Siegel / The Seattle Times",
    "youtube": "ciZkMeNuipQ",
    "youtube2": "",
    "link": "https://www.seattletimes.com/sports/seahawks/this-time-seahawks-come-up-with-goal-line-stand-to-beat-patriots-31-24/"
  },
  {
    "title": "3",
    "order": "3",
    "name": "Bruce Lee chops, one and two",
    "overlay": "right",
    "subhead": "",
    "image": "earl3.jpg",
    "chatter": "<p>The Thomas plays many may most remember were two goal-line forced fumbles against the Rams — three years apart — both miraculously dislodged by forceful arm chops reminiscent of a Bruce Lee movie, each helping preserve key wins for the Seahawks.</p>\n<p>The first came in the final game of the 2014 season, when Thomas made sure Seattle's 20-6 lead was secure, at least more so than the ball in Benny Cunningham's hands. He knocked the ball out and through the end zone for a touchback and a Rams turnover, locking down the No. 1 seed in the NFC.</p>\n<p>And if the Seahawks were maybe going to win the game anyway, all pointed later to Thomas’ play as serving a larger purpose as a symbol for how a defense that at that time was the best in the NFL — and among the best in NFL history — approached every play as if it would decide the Super Bowl.</p>\n<p>“That play was colossal,\" cornerback Richard Sherman said afterward. “Use that: It was a colossal play. Not that it would have determined the game. But it just shows who he is as a person and as a player. His effort, his unwavering commitment, his unwavering effort on every play for that last inch until there is only an inch left.\"</p>\n<p>In 2017, Thomas did it again, racing over to knock the ball out of the outstretched hand of Rams running back Todd Gurley as he reached to try to put LA ahead 7-0 in the first quarter of an early clash for NFC supremacy. Instead, it stayed 0-0 and Seattle got the ball and would go on to win 16-10.</p>\n<p>“It would have made the game a whole different game,’’ Carroll said of Gurley possibly scoring on the play.</p>",
    "credit": "Mike Siegel / The Seattle Times",
    "youtube": "BkENSTceN3E",
    "youtube2": "i1qKp3wGb-0",
    "link": ""
  },
  {
    "title": "4",
    "order": "4",
    "name": "Scoop and score ... and hug",
    "overlay": "left",
    "subhead": "Oct. 30, 2016 | Saints 25, Seahawks 20",
    "image": "earl4.jpg",
    "chatter": "<p>Thomas scored four touchdowns as a Seahawk, two on interception returns — including a 78-yarder to key a win against Houston at home in 2017 that could well have also made this list (and by mentioning it we are sort of putting it on here) — one on a blocked punt return as a rookie at Kansas City and another on a 34-yard fumble return at New Orleans in 2016.</p>\n<p>Maybe the TD against Houston meant more. But we’ll never forget New Orleans for what happened after Thomas scored: his hug of side judge Alex Kemp as he left the field.</p>\n<p>“Just having fun, bro,\" Thomas said later, as only he could.</p>\n<p>“When I saw it, I was like ‘yeah that’s Earl right there,’ \" said defensive end Cliff Avril. “In the heat of the game, you’re allowed to do anything, obviously he hugged the ref. When I saw it I thought it was pretty funny. He didn’t mean anything by it, he was just excited.\"</p>\n<p>ESPN lead off its story on the play by writing that it \"has to be an NFL first.\" Thomas got a penalty for the hug, but the NFL later indicated it realized Earl was just being Earl and meant no harm, declining to give him a fine.</p>",
    "credit": "Dean Rutz / The Seattle Times",
    "youtube": "KPepWOx5fJA",
    "youtube2": "",
    "link": "https://www.seattletimes.com/sports/seahawks/even-with-a-poor-offense-and-questions-about-officiating-seahawks-had-a-shot-to-beat-saints/"
  },
  {
    "title": "5",
    "order": "5",
    "name": "E.T. and Sherm team up to save the day",
    "overlay": "left",
    "subhead": "Sept. 8, 2013 | Seahawks 12, Panthers 7",
    "image": "earl5.jpg",
    "chatter": "<p>Our final play on the list might not be one everyone remembers as clearly as some of the others — Thomas and Sherman teaming up to force a fumble by Carolina running back DeAngelo Williams in the first game of the 2013 season in Charlotte.</p>\n<p>Seattle led 12-7 with just over five minutes left, but Carolina was threatening, with the ball at the Seahawks’ 24-yard line. Williams then broke free, getting inside the 10 before Thomas and Sherman converged and the ball popped out, recovered there by defensive lineman Tony McDaniel.</p>\nNo one knew then just how big the win was, but had the Seahawks lost that day, they may well have fallen to a wild-card spot, and the run to the Super Bowl — if it had happened at all — could have taken a much different course.</p>\n<p>“Right after he got by me, Earl put a fist on it (the ball),\" Sherman said. “Day in, day out, that’s all we practice, going after the ball.\"</p>\n<p>Said Thomas: “You could see the ball and when (running backs) are swinging it and you see a little brown, you just want to punch, and I punched, and the ball came out and I just went crazy.\"</p>\n<p>After the game, the LOB teamwork continued in the locker room as reporters asked Sherman about the play.</p>\n<p>“Don’t go taking my credit, now,” Thomas playfully interjected. “I’m listening over here.”</p>\n<p>“OK,” Sherman eventually decided. “Can we have half-and-half?”</p>\n<p>Then Sherman said: “Great defenses find a way. And that’s what we try to do.”</p>",
    "credit": "Jon Lok / The Seattle Times",
    "youtube": "b2MHgrUYxPc",
    "youtube2": "",
    "link": "https://www.seattletimes.com/sports/seahawks/doug-baldwin-makes-big-third-down-catches-in-seahawks-win/"
  }
]